<!DOCTYPE html>
<html>
    <head>
        <meta charset="utf-8"/>
        <title>Build-in fncts</title>
    </head>
<body>
<?php
    $tmp = 2;
    //Удаляет переменную
    unset($tmp);    
    //Проверка переменной на существование
    /*if (!isset($tmp))
        echo "Переменной не существует";
    else
        echo "Переменная существует";*/
        
    //Получает опции конфигурации
    if( ! ini_get('date.timezone') )
    {
        //установка часового пояса по умолчанию
       date_default_timezone_set('Europe/Moscow');
    }
    /*
        Описание функции date();
    */
    //Подробней http://www.php.su/date
    //проверка не высокосный год, если вернул 1 то год высокосный
    if (date("L"))
        echo "Сейчас высокосный год<br />";    
    // вывод дня недели, например Wednesday
    echo date("l")."<br />";
    /*
        вывод текущего времени
    */
        //H - формат 24 часовой
        //h - формат 12 часовой
        //I - проверяет летнего времени
        //i - минуты с введущими нулями 00-59
        //s - секунды с ведущими нулями 00-59
    echo date("H:i:s")."<br />";
    /*
        вывод текущей даты
    */
    //F - полное наименование месяца
    //m - месяц с ведущими нулями (05)
    //M - сокращенно месяц (Dec, Oct...)
    //Y - полный ввывод года (2016)
    //y - сокращенный вывод года (16)
    //l - полный вывод названия дня недели
    //j - номер месяца без ведущих нулей
        //j+S (jS) - номер месяца с суфиксов st, nd, rd или th. 
        //Применяется совместно с j 
    //n - номер месяца вез ведущих нулей (5)
    echo date("Y:jS:D")."<br />";
    //t - вывод дней в текущем месяце
    echo date("t")."<br />";
    //полный вывод текущей даты
    echo date("Y:F:l")."<br />";
    //time() - возвращает количество секунд прошедших с 1 января 1970года
    echo "С 1 января 1970 года прошло ".time()." секунд <br />";
    /*
        Преобразование количества секунд с 1 января 1970 года в чч:мм:сс
    */
    $seconds = time();
    $hours = $seconds / 3600;
    //удаление цифр после точки 
    $hours = preg_replace('/\..*/','',$hours);
        echo $hours." часов ";
    //подсчет минут
    $minutes = $seconds % 3600 / 60;
    //удаление цифр после точки 
    $minutes = preg_replace('/\..*/','',$minutes);
        echo $minutes. " минут ";
    //подсчет секунд
    $seconds = $seconds % 3600 % 60;
        echo $seconds." секунд";
?>
    </body>
</html>